from telegram import Update
from telegram.ext import ApplicationBuilder, MessageHandler, ContextTypes, filters

TOKEN = "8584981668:AAHm1RTtVp4nJ7TVxwG3pmfn9q--obqsSz0"

# Многострочный текст с ссылками
AUTO_REPLY = (
    "Теперь все запросы, которые вы раньше отправляли в группу «Конструкции РИМ / САЙТ», "
    "нужно передавать через заявку в Битрикс24.\n\n"

    "Почему это удобно:\n"
    "— Ответственные исполнители сразу видят поставленную задачу.\n"
    "— Вы видите ответы и решение только по своим заявкам, не отвлекаясь на сообщения коллег.\n"
    "— Можно отслеживать статус и сроки решения каждой задачи.\n\n"

    "Подготовили для вас простую инструкцию:\n"
    "— По каким вопросам можно обращаться.\n"
    "— Как оставить заявку с компьютера.\n"
    "— Как оставить заявку через приложение со смартфона.\n\n"

    "Инструкция доступна на двух платформах:\n"
    "• [Google Документ](https://docs.google.com/document/d/1CXJovq3JmKXqIvku1GOaV6gyg9SdPs23oaIg4iVUl9I/edit?tab=t.0)\n"
    "• [iSpring база знаний](https://rim-m.ispringlearn.ru/app/user-portal/knowledge-base/content-player/76ef7137-b3d6-11f0-af74-02756f8b0442)\n\n"

    "Чтобы было проще — записали два коротких видео, отправим их в следующем сообщении.\n\n"
    "Если возникнут вопросы или идеи, как улучшить процесс в Битрикс24, напишите @MakarOsipov 🧡"
)

async def reply(update: Update, context: ContextTypes.DEFAULT_TYPE):
    await update.message.reply_text(
        AUTO_REPLY,
        parse_mode="Markdown",  # делает ссылки кликабельными
        disable_web_page_preview=True  # чтобы не было длинных предпросмотров
    )

app = ApplicationBuilder().token(TOKEN).build()
app.add_handler(MessageHandler(filters.TEXT & ~filters.COMMAND, reply))

print("✅ Бот запущен и ждёт сообщения...")
app.run_polling()
